Revit 2026 API

# IFCProductWrapperAddFinishMaterial Method

---

Adds a material handle to associate with the IfcProduct in this wrapper.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void AddFinishMaterial(
	IFCAnyHandle material
)
```
```vb
Public Sub AddFinishMaterial (
	material As IFCAnyHandle
)
```
```cpp
public:
void AddFinishMaterial(
	IFCAnyHandle^ material
)
```
```fsharp
member AddFinishMaterial :
        material : IFCAnyHandle -> unit
```

#### Parameters

material IFCAnyHandle
     The material handle.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCProductWrapper Class

Autodesk.Revit.DB.IFC Namespace